In [1]:
import pandas as pd

In [8]:
customers = pd.read_csv('customersv2.csv', delimiter=';')
transactions = pd.read_csv('Transactionsv2.csv',delimiter=';')
products = pd.read_csv('productsv2.csv',delimiter=';')

In [7]:
customers.head()

       52 sex  birth
0  c_4410   f   1967
1  c_7839   f   1975
2  c_1699   f   1984
3  c_5961   f   1962
4  c_5320   m   1943

In [10]:
customers.isnull().sum()

52       0
sex      0
birth    0
dtype: int64

In [13]:
products.head()

  id_prod  price  categ
0  0_1421  19.99      0
1  0_1368   5.13      0
2   0_731  17.99      0
3   1_587   4.99      1
4  0_1507   3.99      0

In [11]:
products.isnull().sum()

id_prod    0
price      0
categ      0
dtype: int64

In [14]:
transactions.head()

  id_prod                        date session_id client_id
0  0_1259  2021-03-01 00:01:07.843138        s_1     c_329
1  0_1390  2021-03-01 00:02:26.047414        s_2     c_664
2  0_1352  2021-03-01 00:02:38.311413        s_3     c_580
3  0_1458  2021-03-01 00:04:54.559692        s_4    c_7912
4  0_1358  2021-03-01 00:05:18.801198        s_5    c_2033

In [12]:
transactions.isnull().sum()

id_prod       0
date          0
session_id    0
client_id     0
dtype: int64